wty2019wty/IR-rx-ir_monitor/sdkconfig.defaults
# ESP32-S3-N16R8: 16MB flash + 8MB octal PSRAM
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# 8MB octal PSRAM (ESP32-S3-WROOM-1-N16R8)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# 1kHz tick for snappier UI timing
CONFIG_FREERTOS_HZ=1000

# Storage configuration for IR recordings (LittleFS)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
